{
  "education": [
    {
      "awards_achievements": null,
      "degree": "DEC in Computer Science Technology",
      "department": "Social Science \u0026 Business Technologies",
      "duration": "2017-2019",
      "school_name": "College Maisonneuve"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_BikervensBernard",
  "highlighted_projects": [
    {
      "description": "Implemented a Go game (an abstract strategy board game for two players in which the aim is to surround more territory than the opponent) in java while using jSwing widget toolkit for the GUI",
      "name": "Go game (Education)"
    },
    {
      "description": "Implemented a c# api to access to the ministry of education's course descriptions and requirements in order to help teachers from Maisonneuve college build each semester's syllabus. A document that communicates information about a specific academic course or class and defines expectations and responsibilities was generated and downloadable. The application was available via the school's portal and the api was used for the mobile app as well.",
      "name": "Schedule planing"
    },
    {
      "description": "Implemented a TikTok clone to help viewers watch and discover a multitude of personalized short videos. The video hosting was made using amazon web services and the client side was developed using my web framework of choice, Vue.js and deployed using vercel.com The back-end was fully made in javascript using tool like Node.js for the server and graphql and mongodb fo the database. The goal was mostly to show how I, as a Developer, would implement a huge architecture like tiktok and how i would use OOP to implement different design pattern to roll out an engaging algorithm.",
      "name": "TikTok Clone (PoC)"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a CentOS based Linux node cluster agent. This agent keep track of each node's hardware characteristics and real-time resource utilization (e.g. CPU/Memory) for future resource planning purposes (e.g. add/remove servers that might be too slow or underused). The data will be saved in a PostgreSQL relational database management system (RDBMS). The SQL queries will answer business questions such as 'show average memory usage in percentage over 1 minute intervals for each node'.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Developed a Java app which can post|show|delete Twitter post via Twitter REST API",
        "JDBC App: Developed a Java tool with JDBC to get data in and out of an application (using any relational database)",
        "Grep App: Developed a simple grep app in Java. The app searches for a text pattern recursively in a given directory, and output matched lines to a file"
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "Developed a trading system with the microservice architecture and Springboot framework. Since this is a PoC (proof of concept), I did not need to deal with the real banking or exchange systems. This PoC project focuses on features (e.g. functionalities, and feasibility) rather than performance and security. The trading platform is a REST API consumed by the front-end applications. The application allows users to manage client profiles and accounts, monitor portfolio performance, and trade securities. The Springboot app fetches data from IEX Cloud which offers free market data (e.g. stock price) via its REST API. ",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "Not started",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "Not started",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "Not started",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "Not started",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Bikervens Bernard",
  "others": [
    {
      "bullets": [
        "French High school Diploma, (Montreal)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "fluent in French/English"
      ],
      "title": "Personal Skills"
    },
    {
      "bullets": [
        "Basketball player",
        "Competitive gaming"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Implemented, tested, and deployed a Bash script program using Linux command lines, Bash scripts, a PostgreSQL instance, Git Flow, and Docker using Agile/Scrum methodology. Oversaw daily stand-up meetings (daily scrums), which coordinated and tracked team progress. Managed each aspect of the systems development life cycle (SDLC) architecture.",
      "duration": "2021-present",
      "title": "Software Developer"
    },
    {
      "company": "Equisoft",
      "description": "Developed, maintained created and executed End to End clear and concise functional tests cases using selenium and the .NET framework. for the automation. Extended existing test automation or create new scripts to provide a high level of test coverage across existing functionalities.",
      "duration": "2020-2021",
      "title": "Test automation specialist"
    }
  ],
  "skills": {
    "competent": [
      "HTML | CSS",
      ".NET framework C# | selenium",
      "Docker",
      "JavaScript",
      "Graphql"
    ],
    "familiar": [
      "React",
      "AWS",
      "Firebase",
      "C++",
      "Android studio"
    ],
    "proficient": [
      "Java (OOP)",
      "Linux | Bash",
      "RDBMS and non RDBMS such as MongoDB and MySQL",
      "Agile approach",
      "Scrum framework",
      "Github version control system",
      "Vue.js | Node.js"
    ]
  },
  "summary": "My name is Bernard, I completed a 3-year DEC degree in computer science technology (software development) at Maisonneuve College in Montreal and I'm a software developer. My job is to design computer applications or programs. I do this by building a complex architecture in an array of different technologies based on current needs. I design, implement, test and deploy modern solutions to everyday technological concerns. I am very passionate about technology and software development because it has allowed me to express my creativity while meeting my need to always learn and work to solve problems."
}
