{
  "education": [
    {
      "awards_achievements": null,
      "degree": "DEC in Computer Science Technology",
      "department": "Social Science \u0026 Business Technologies",
      "duration": "2017-2019",
      "school_name": "College Maisonneuve"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_BikervensBernard",
  "highlighted_projects": [
    {
      "description": "Implemented a Go game (an abstract strategy board game for two players in which the aim is to surround more territory than the opponent) in Java using JSwing widget toolkit for a platform-independent and lightweight GUI. The project was later deployed using a modern tech stack. The MVC architecture was used with the MERN stack (MongoDB as a database for players' information, Express.js as a server-side web framework, React.js as the front end, Node.js as my JavaScript server platform",
      "name": "Go game (Education)"
    },
    {
      "description": "Implemented a C# API to access the ministry of education's course descriptions and requirements to help teachers from Maisonneuve college build each semester's syllabus. The syllabus document communicates information about a specific academic course and defines expectations and responsibilities. The document is now programmatically generatable and downloadable to all students. The application is available via the school's portal and the API was used for the mobile app as well.",
      "name": "Schedule planning"
    },
    {
      "description": "Implemented a TikTok clone to help viewers watch and discover a multitude of personalized short videos. The video hosting was made using AWS and the client side was developed using Vue.js and deployed using Vercel. The back-end is a Node.js server, MongoDB was used for the database, AWS was used for fast video upload and fast streaming. A recommender system was implemented separately using machine learning.",
      "name": "TikTok Clone (PoC)"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a CentOS-based Linux node monitoring agent. This agent keeps track of each node's hardware characteristics and real-time resource utilization (e.g. CPU/Memory) for future resource planning purposes. The data is saved in a PostgreSQL database.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App: Developed a Java app that used a DAO to post, show and delete Twitter posts via Twitter's REST API. Springboot was used to handle app dependencies and to ensure all the app layers functioned accordingly. The app was built using Maven and deployed through Dockerhub as a Docker image for easy execution and distribution.",
        "JDBC App: Developed a Java tool with JDBC to get data in and out of a PSQL docker instance Database. the app, built using Maven, uses for easy application layer and database management the DAO pattern.",
        "Grep App: Developed a grep app in Java. The app searches recursively for a text pattern in a given directory and outputs matched lines to a file. The app was dockerized and deployed on Dockerhub for easy access and distribution."
      ],
      "git_url": "/core_Java",
      "name": "Core Java Apps"
    },
    {
      "description": "Developed a trading system microservice using the Springboot framework. This PoC (proof of concept) project focuses on features (e.g. functionalities and feasibilities). The trading platform is a REST API consumed by a front-end application that I implemented separately  using Next.js. The application allows users to manage client profiles, and accounts, monitor portfolio performance, and trade securities.",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "Designed, implemented, tested, and deployed a frontend app built upon the SpringBoot project's backend listed above. The app lets users with a modern UI where they can add accounts, check stock quotes, and read/update their account info and balance. All components were created with React.js, stylized with Tailwind's utility-first CSS framework, managed with NPM, tested in the browser, and then released on GitHub.",
      "git_url": "/frontend",
      "name": "Trading app Frontend"
    }
  ],
  "name": "Bikervens Bernard",
  "others": [
    {
      "bullets": [
        "French High school Diploma, (Montreal)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Fluent in French and English"
      ],
      "title": "Personal Skills"
    },
    {
      "bullets": [
        "Basketball player",
        "Competitive gaming OW and COD"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Designed, utilizing Agile/Scrum methodology, Git Flow, and Docker, I designed, implemented, tested, and deployed software projects related to Linux/Bash scripting, SQL, Java and React. Went through Master Code Review meetings that validate the required expertise and acceptable code quality. Collaborated in a team setting where I was in charge of daily scrum meetings and tracked the progress of the scrum team during sprints.",
      "duration": "2022-present",
      "title": "Software Developer"
    },
    {
      "company": "Equisoft",
      "description": "Developed, maintained, created and executed End-to-End clear and concise functional test cases using Selenium and the .NET framework. I Extended existing tests and created new scripts to provide a higher level of test coverage across existing functionalities.",
      "duration": "2020-2022",
      "title": "Test Automation Specialist"
    }
  ],
  "skills": {
    "competent": [
      "HTML/CSS",
      ".NET",
      "C#",
      "Selenium",
      "Docker",
      "JavaScript",
      "Graphql"
    ],
    "familiar": [
      "AWS",
      "Firebase",
      "C++",
      "Android studio",
      "Xcode"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "PostgreSQL/MySQL and MongoDB",
      "Agile approach",
      "Git",
      "Vue.js/Next.js and Node.js"
    ]
  },
  "summary": "My name is Bernard, and I am passionate about technology and software development. It is the reason why I completed a 3-year DEC degree in computer science technology (software development) at Maisonneuve College in Montreal. I love expressing my creativity and love creating and building things in general. I found that technology is a perfect medium to explore those aspects of my personality this is why I joined the Jarvis consulting firm. At Jarvis, I was put in situations where I had to learn fast, touched many new technologies, and solve and answer business problems. I got to design, implement, test, and deploy many applications including a Linux/SQL server usage bot, a Java grep implementation, a JDBC app, a Twitter CRUD backend app, a full-stack Next.js app, and a SpringBoot stock management app."
}
